Revit 2026 API
ExecutedEventArgs Methods
The ExecutedEventArgs type exposes the following members.
Methods
Name | Description
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetJournalData |  Gets the journal data associated to this command (on journal playback).
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetJournalData
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ExecutedEventArgs Class
Autodesk.Revit.UI.Events Namespace